yuplus/nxp-mcx-series/MCXA344/periph3/PERI_MAU.h
#define MAU_OP_CTRL_OVDT_EN_RES1_MASK            (0x100U)
#define MAU_OP_CTRL_OVDT_EN_RES1_SHIFT           (8U)
/*! OVDT_EN_RES1 - Override RES1 Data Type Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_OP_CTRL_OVDT_EN_RES1(x)              (((uint32_t)(((uint32_t)(x)) << MAU_OP_CTRL_OVDT_EN_RES1_SHIFT)) & MAU_OP_CTRL_OVDT_EN_RES1_MASK)

#define MAU_OP_CTRL_OVDT_RES1_MASK               (0x600U)
#define MAU_OP_CTRL_OVDT_RES1_SHIFT              (9U)
/*! OVDT_RES1 - Override RES1 Data Type
 *  0b00..UINT
 *  0b01..INT
 *  0b10..Q1.X
 *  0b11..FLOAT
 */
#define MAU_OP_CTRL_OVDT_RES1(x)                 (((uint32_t)(((uint32_t)(x)) << MAU_OP_CTRL_OVDT_RES1_SHIFT)) & MAU_OP_CTRL_OVDT_RES1_MASK)

#define MAU_OP_CTRL_OVDT_EN_RES2_MASK            (0x10000U)
#define MAU_OP_CTRL_OVDT_EN_RES2_SHIFT           (16U)
/*! OVDT_EN_RES2 - Override RES2 Data Type Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_OP_CTRL_OVDT_EN_RES2(x)              (((uint32_t)(((uint32_t)(x)) << MAU_OP_CTRL_OVDT_EN_RES2_SHIFT)) & MAU_OP_CTRL_OVDT_EN_RES2_MASK)

#define MAU_OP_CTRL_OVDT_RES2_MASK               (0x60000U)
#define MAU_OP_CTRL_OVDT_RES2_SHIFT              (17U)
/*! OVDT_RES2 - Override RES2 Data Type
 *  0b00..UINT
 *  0b01..INT
 *  0b10..Q1.X
 *  0b11..FLOAT
 */
#define MAU_OP_CTRL_OVDT_RES2(x)                 (((uint32_t)(((uint32_t)(x)) << MAU_OP_CTRL_OVDT_RES2_SHIFT)) & MAU_OP_CTRL_OVDT_RES2_MASK)

#define MAU_OP_CTRL_OVDT_EN_RES3_MASK            (0x1000000U)
#define MAU_OP_CTRL_OVDT_EN_RES3_SHIFT           (24U)
/*! OVDT_EN_RES3 - Override RES3 Data Type Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_OP_CTRL_OVDT_EN_RES3(x)              (((uint32_t)(((uint32_t)(x)) << MAU_OP_CTRL_OVDT_EN_RES3_SHIFT)) & MAU_OP_CTRL_OVDT_EN_RES3_MASK)

#define MAU_OP_CTRL_OVDT_RES3_MASK               (0x6000000U)
#define MAU_OP_CTRL_OVDT_RES3_SHIFT              (25U)
/*! OVDT_RES3 - Override RES3 Data Type
 *  0b00..UINT
 *  0b01..INT
 *  0b10..Q1.X
 *  0b11..FLOAT
 */
#define MAU_OP_CTRL_OVDT_RES3(x)                 (((uint32_t)(((uint32_t)(x)) << MAU_OP_CTRL_OVDT_RES3_SHIFT)) & MAU_OP_CTRL_OVDT_RES3_MASK)
/*! @} */

/*! @name RES_STATUS_IE - Result Status Interrupt Enable */
/*! @{ */

#define MAU_RES_STATUS_IE_RES0_IE_MASK           (0x1U)
#define MAU_RES_STATUS_IE_RES0_IE_SHIFT          (0U)
/*! RES0_IE - RES0 Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_RES_STATUS_IE_RES0_IE(x)             (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_IE_RES0_IE_SHIFT)) & MAU_RES_STATUS_IE_RES0_IE_MASK)

#define MAU_RES_STATUS_IE_RES1_IE_MASK           (0x2U)
#define MAU_RES_STATUS_IE_RES1_IE_SHIFT          (1U)
/*! RES1_IE - RES1 Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_RES_STATUS_IE_RES1_IE(x)             (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_IE_RES1_IE_SHIFT)) & MAU_RES_STATUS_IE_RES1_IE_MASK)

#define MAU_RES_STATUS_IE_RES2_IE_MASK           (0x4U)
#define MAU_RES_STATUS_IE_RES2_IE_SHIFT          (2U)
/*! RES2_IE - RES2 Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_RES_STATUS_IE_RES2_IE(x)             (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_IE_RES2_IE_SHIFT)) & MAU_RES_STATUS_IE_RES2_IE_MASK)

#define MAU_RES_STATUS_IE_RES3_IE_MASK           (0x8U)
#define MAU_RES_STATUS_IE_RES3_IE_SHIFT          (3U)
/*! RES3_IE - RES3 Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_RES_STATUS_IE_RES3_IE(x)             (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_IE_RES3_IE_SHIFT)) & MAU_RES_STATUS_IE_RES3_IE_MASK)
/*! @} */

/*! @name RES_STATUS - Result Status */
/*! @{ */

#define MAU_RES_STATUS_RES0_NX_MASK              (0x1U)
#define MAU_RES_STATUS_RES0_NX_SHIFT             (0U)
/*! RES0_NX - RES0 IEEE Inexact Flag
 *  0b0..The result is not rounded.
 *  0b1..The result is rounded, and as a result some digits lost.
 */
#define MAU_RES_STATUS_RES0_NX(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES0_NX_SHIFT)) & MAU_RES_STATUS_RES0_NX_MASK)

#define MAU_RES_STATUS_RES0_UF_MASK              (0x2U)
#define MAU_RES_STATUS_RES0_UF_SHIFT             (1U)
/*! RES0_UF - RES0 IEEE Underflow Flag
 *  0b0..No tiny non-zero result is detected.
 *  0b1..A tiny non-zero result is detected.
 */
#define MAU_RES_STATUS_RES0_UF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES0_UF_SHIFT)) & MAU_RES_STATUS_RES0_UF_MASK)

#define MAU_RES_STATUS_RES0_OF_MASK              (0x4U)
#define MAU_RES_STATUS_RES0_OF_SHIFT             (2U)
/*! RES0_OF - RES0 IEEE Overflow Flag
 *  0b0..The result format's largest finite number is not exceeded.
 *  0b1..The result format's largest finite number is exceeded.
 */
#define MAU_RES_STATUS_RES0_OF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES0_OF_SHIFT)) & MAU_RES_STATUS_RES0_OF_MASK)

#define MAU_RES_STATUS_RES0_DZ_MASK              (0x8U)
#define MAU_RES_STATUS_RES0_DZ_SHIFT             (3U)
/*! RES0_DZ - RES0 IEEE Divide by Zero Flag
 *  0b0..No exact infinite result is defined for an operation on finite operands.
 *  0b1..An exact infinite result is defined for an operation on finite operands.
 */
#define MAU_RES_STATUS_RES0_DZ(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES0_DZ_SHIFT)) & MAU_RES_STATUS_RES0_DZ_MASK)

#define MAU_RES_STATUS_RES0_NV_MASK              (0x10U)
#define MAU_RES_STATUS_RES0_NV_SHIFT             (4U)
/*! RES0_NV - RES0 IEEE Invalid Flag
 *  0b0..There is usefully definable result.
 *  0b1..There is no usefully definable result.
 */
#define MAU_RES_STATUS_RES0_NV(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES0_NV_SHIFT)) & MAU_RES_STATUS_RES0_NV_MASK)

#define MAU_RES_STATUS_RES0_ERR_MASK             (0x20U)
#define MAU_RES_STATUS_RES0_ERR_SHIFT            (5U)
/*! RES0_ERR - RES0 Indirect Operation Error Flag
 *  0b0..No invalid indirect operation is detected.
 *  0b1..An invalid indirect operation error is detected.
 */
#define MAU_RES_STATUS_RES0_ERR(x)               (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES0_ERR_SHIFT)) & MAU_RES_STATUS_RES0_ERR_MASK)

#define MAU_RES_STATUS_RES0_OVWR_MASK            (0x40U)
#define MAU_RES_STATUS_RES0_OVWR_SHIFT           (6U)
/*! RES0_OVWR - RES0 Overwrite Flag
 *  0b0..The value of RES0 has been read.
 *  0b1..The value of RES0 has not been read yet and is overwritten by a new MAUWRAP result.
 */
#define MAU_RES_STATUS_RES0_OVWR(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES0_OVWR_SHIFT)) & MAU_RES_STATUS_RES0_OVWR_MASK)

#define MAU_RES_STATUS_RES0_FULL_MASK            (0x80U)
#define MAU_RES_STATUS_RES0_FULL_SHIFT           (7U)
/*! RES0_FULL - RES0 Full Flag
 *  0b0..RES0 has not updated and cannot be read.
 *  0b1..RES0 has updated and can be read.
 */
#define MAU_RES_STATUS_RES0_FULL(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES0_FULL_SHIFT)) & MAU_RES_STATUS_RES0_FULL_MASK)

#define MAU_RES_STATUS_RES1_NX_MASK              (0x100U)
#define MAU_RES_STATUS_RES1_NX_SHIFT             (8U)
/*! RES1_NX - RES1 IEEE Inexact Flag
 *  0b0..The result is not rounded.
 *  0b1..The result is rounded, and as a result some digits lost.
 */
#define MAU_RES_STATUS_RES1_NX(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES1_NX_SHIFT)) & MAU_RES_STATUS_RES1_NX_MASK)

