yuplus/nxp-mcx-series/MCXA344/periph3/PERI_MAU.h
#define MAU_RES_STATUS_RES3_NX_MASK              (0x1000000U)
#define MAU_RES_STATUS_RES3_NX_SHIFT             (24U)
/*! RES3_NX - RES3 IEEE Inexact Flag
 *  0b0..The result is not rounded.
 *  0b1..The result is rounded, and as a result some digits lost.
 */
#define MAU_RES_STATUS_RES3_NX(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_NX_SHIFT)) & MAU_RES_STATUS_RES3_NX_MASK)

#define MAU_RES_STATUS_RES3_UF_MASK              (0x2000000U)
#define MAU_RES_STATUS_RES3_UF_SHIFT             (25U)
/*! RES3_UF - RES3 IEEE Underflow Flag
 *  0b0..No tiny non-zero result is detected.
 *  0b1..A tiny non-zero result is detected.
 */
#define MAU_RES_STATUS_RES3_UF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_UF_SHIFT)) & MAU_RES_STATUS_RES3_UF_MASK)

#define MAU_RES_STATUS_RES3_OF_MASK              (0x4000000U)
#define MAU_RES_STATUS_RES3_OF_SHIFT             (26U)
/*! RES3_OF - RES3 IEEE Overflow Flag
 *  0b0..The result format's largest finite number is not exceeded.
 *  0b1..The result format's largest finite number is exceeded.
 */
#define MAU_RES_STATUS_RES3_OF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_OF_SHIFT)) & MAU_RES_STATUS_RES3_OF_MASK)

#define MAU_RES_STATUS_RES3_DZ_MASK              (0x8000000U)
#define MAU_RES_STATUS_RES3_DZ_SHIFT             (27U)
/*! RES3_DZ - RES3 IEEE Divide by Zero Flag
 *  0b0..No exact infinite result is defined for an operation on finite operands.
 *  0b1..An exact infinite result is defined for an operation on finite operands.
 */
#define MAU_RES_STATUS_RES3_DZ(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_DZ_SHIFT)) & MAU_RES_STATUS_RES3_DZ_MASK)

#define MAU_RES_STATUS_RES3_NV_MASK              (0x10000000U)
#define MAU_RES_STATUS_RES3_NV_SHIFT             (28U)
/*! RES3_NV - RES3 IEEE Invalid Flag
 *  0b0..There is usefully definable result.
 *  0b1..There is no usefully definable result.
 */
#define MAU_RES_STATUS_RES3_NV(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_NV_SHIFT)) & MAU_RES_STATUS_RES3_NV_MASK)

#define MAU_RES_STATUS_RES3_ERR_MASK             (0x20000000U)
#define MAU_RES_STATUS_RES3_ERR_SHIFT            (29U)
/*! RES3_ERR - RES3 Indirect Operation Error Flag
 *  0b0..No invalid indirect operation is detected.
 *  0b1..An invalid indirect operation error is detected.
 */
#define MAU_RES_STATUS_RES3_ERR(x)               (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_ERR_SHIFT)) & MAU_RES_STATUS_RES3_ERR_MASK)

#define MAU_RES_STATUS_RES3_OVWR_MASK            (0x40000000U)
#define MAU_RES_STATUS_RES3_OVWR_SHIFT           (30U)
/*! RES3_OVWR - RES3 Overwrite Flag
 *  0b0..The value of RES3 has been read.
 *  0b1..The value of RES3 has not been read yet and is overwritten by a new MAUWRAP result.
 */
#define MAU_RES_STATUS_RES3_OVWR(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_OVWR_SHIFT)) & MAU_RES_STATUS_RES3_OVWR_MASK)

#define MAU_RES_STATUS_RES3_FULL_MASK            (0x80000000U)
#define MAU_RES_STATUS_RES3_FULL_SHIFT           (31U)
/*! RES3_FULL - RES3 Full Flag
 *  0b0..RES3 has not updated and cannot be read.
 *  0b1..RES3 has updated and can be read.
 */
#define MAU_RES_STATUS_RES3_FULL(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES3_FULL_SHIFT)) & MAU_RES_STATUS_RES3_FULL_MASK)
/*! @} */

/*! @name RES0 - Result Register 0 */
/*! @{ */

#define MAU_RES0_MAU_RES0_MASK                   (0xFFFFFFFFU)
#define MAU_RES0_MAU_RES0_SHIFT                  (0U)
/*! MAU_RES0 - MAUWRAP Result Register 0 */
#define MAU_RES0_MAU_RES0(x)                     (((uint32_t)(((uint32_t)(x)) << MAU_RES0_MAU_RES0_SHIFT)) & MAU_RES0_MAU_RES0_MASK)
/*! @} */

/*! @name RES1 - Result Register 1 */
/*! @{ */

#define MAU_RES1_MAU_RES1_MASK                   (0xFFFFFFFFU)
#define MAU_RES1_MAU_RES1_SHIFT                  (0U)
/*! MAU_RES1 - MAUWRAP Result Register 1 */
#define MAU_RES1_MAU_RES1(x)                     (((uint32_t)(((uint32_t)(x)) << MAU_RES1_MAU_RES1_SHIFT)) & MAU_RES1_MAU_RES1_MASK)
/*! @} */

/*! @name RES2 - Result Register 2 */
/*! @{ */

#define MAU_RES2_MAU_RES2_MASK                   (0xFFFFFFFFU)
#define MAU_RES2_MAU_RES2_SHIFT                  (0U)
/*! MAU_RES2 - MAUWRAP Result Register 2 */
#define MAU_RES2_MAU_RES2(x)                     (((uint32_t)(((uint32_t)(x)) << MAU_RES2_MAU_RES2_SHIFT)) & MAU_RES2_MAU_RES2_MASK)
/*! @} */

/*! @name RES3 - Result Register 3 */
/*! @{ */

#define MAU_RES3_MAU_RES3_MASK                   (0xFFFFFFFFU)
#define MAU_RES3_MAU_RES3_SHIFT                  (0U)
/*! MAU_RES3 - MAUWRAP Result Register 3 */
#define MAU_RES3_MAU_RES3(x)                     (((uint32_t)(((uint32_t)(x)) << MAU_RES3_MAU_RES3_SHIFT)) & MAU_RES3_MAU_RES3_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group MAU_Register_Masks */


/*!
 * @}
 */ /* end of group MAU_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_MAU_H_ */

